In [98]:
import pandas as pd

In [99]:
df_sales = pd.read_csv('../Data/SalesData.csv', delimiter=',', header='infer', encoding='latin-1')

In [100]:
df_sales.head(5)

,Date,Month,Quarter,Year,Qty,Product,Category,Cust.Name,Comp.Name,Pharmacy,Area Code,Code,Location
0,1-11-2015,11,Q4,2015,2,Injection 14,Skinbooster,Customer 1,Company 1,Pharmacy 1,NW3,NW,London
1,1-11-2015,11,Q4,2015,1,Injection 14,Skinbooster,Customer 1,Company 1,Pharmacy 1,NW3,NW,London
2,1-11-2015,11,Q4,2015,1,Injection 1,Dermafiller,NaN,NaN,Pharmacy 2,HA8,HA,Outside London M25
3,1-11-2015,11,Q4,2015,1,Injection 2,Dermafiller,NaN,NaN,Pharmacy 2,HA8,HA,Outside London M25
4,1-11-2015,11,Q4,2015,4,Injection 14,Skinbooster,NaN,NaN,Pharmacy 2,PE21,PE,"NorthEast, Midlands"

Changing the Quarter column from Q1 to 1, Q2 to 2, Q3 to 3 and Q4 to 4

In [101]:
df_sales['Quarter'].replace(to_replace = "Q1", 
                 value = 1, 
                  inplace = True)
df_sales['Quarter'].replace(to_replace = "Q2", 
                 value = 2, 
                  inplace = True)
df_sales['Quarter'].replace(to_replace = "Q3", 
                 value = 3, 
                  inplace = True)
df_sales['Quarter'].replace(to_replace = "Q4", 
                 value = 4, 
                  inplace = True)

In [102]:
print(df_sales['Quarter'].unique())

[4 1 2 3]

Drop columns: Cust.Name, Comp.Name, Area Code and Code

In [103]:
df_sales.drop('Cust.Name', axis=1, inplace=True)
df_sales.drop('Comp.Name', axis=1, inplace=True)
df_sales.drop('Area Code', axis=1, inplace=True)
df_sales.drop('Code', axis=1, inplace=True)

In [104]:
df_sales.head()

,Date,Month,Quarter,Year,Qty,Product,Category,Pharmacy,Location
0,1-11-2015,11,4,2015,2,Injection 14,Skinbooster,Pharmacy 1,London
1,1-11-2015,11,4,2015,1,Injection 14,Skinbooster,Pharmacy 1,London
2,1-11-2015,11,4,2015,1,Injection 1,Dermafiller,Pharmacy 2,Outside London M25
3,1-11-2015,11,4,2015,1,Injection 2,Dermafiller,Pharmacy 2,Outside London M25
4,1-11-2015,11,4,2015,4,Injection 14,Skinbooster,Pharmacy 2,"NorthEast, Midlands"

Remove negative quantities

In [105]:
df_sales.describe()

              Month       Quarter          Year           Qty
count  68765.000000  68765.000000  68765.000000  68765.000000
mean       6.663099      2.540726   2019.926547      5.991696
std        3.508505      1.154372      1.441166      9.781164
min        1.000000      1.000000   2015.000000    -35.000000
25%        3.000000      1.000000   2019.000000      2.000000
50%        7.000000      3.000000   2020.000000      3.000000
75%       10.000000      4.000000   2021.000000      8.000000
max       12.000000      4.000000   2022.000000    750.000000

In [106]:
df_sales['Qty'].unique()

array([  2,   1,   4,   8,   3,  10,   5,   6,  15,   7,  18,  40,  16,
        12,  13,   9,  30,  20,  24,  50,  60, 100,  17,  21,  -6,  11,
        14,  -5,  28,  52,  26,  80,  19,  -3,  32,  -2,  38,   0,  25,
        70,  64, 140,  56,  27,  33,  35,  31,  75,  36,  68,  -8,  65,
        34,  92,  78,  -1,  83,  55, 110, -12,  22, -24,  41,  48,  84,
        53,  49,  69,  23,  42,  47,  29,  39, 150,  72,  51,  37,  59,
        45,  99,  -4,  58, -10,  44,  46, 136,  74,  61,  67,  73, 102,
       227,  66,  54,  85, 120,  43,  63,  57, 144, 200,  76,  77, 210,
       -17,  -9, 114,  82, -14,  81, -35,  96,  97, 105, -16,  90, 300,
       157, 400, 245, 121,  86, 280, 750, 152,  87, 115], dtype=int64)

In [112]:
df_sales = df_sales[df_sales['Qty'] != -35]
df_sales = df_sales[df_sales['Qty'] != -24]
df_sales = df_sales[df_sales['Qty'] != -17]
df_sales = df_sales[df_sales['Qty'] != -16]
df_sales = df_sales[df_sales['Qty'] != -14]
df_sales = df_sales[df_sales['Qty'] != -12]
df_sales = df_sales[df_sales['Qty'] != -10]
df_sales = df_sales[df_sales['Qty'] != -9]
df_sales = df_sales[df_sales['Qty'] != -8]
df_sales = df_sales[df_sales['Qty'] != -6]
df_sales = df_sales[df_sales['Qty'] != -5]
df_sales = df_sales[df_sales['Qty'] != -4]
df_sales = df_sales[df_sales['Qty'] != -3]
df_sales = df_sales[df_sales['Qty'] != -2]
df_sales = df_sales[df_sales['Qty'] != -1]
df_sales = df_sales[df_sales['Qty'] != 0]

In [111]:
df_sales['Qty'].unique()

array([  2,   1,   4,   8,   3,  10,   5,   6,  15,   7,  18,  40,  16,
        12,  13,   9,  30,  20,  24,  50,  60, 100,  17,  21,  11,  14,
        28,  52,  26,  80,  19,  32,  38,   0,  25,  70,  64, 140,  56,
        27,  33,  35,  31,  75,  36,  68,  65,  34,  92,  78,  83,  55,
       110,  22,  41,  48,  84,  53,  49,  69,  23,  42,  47,  29,  39,
       150,  72,  51,  37,  59,  45,  99,  58,  44,  46, 136,  74,  61,
        67,  73, 102, 227,  66,  54,  85, 120,  43,  63,  57, 144, 200,
        76,  77, 210, 114,  82,  81,  96,  97, 105,  90, 300, 157, 400,
       245, 121,  86, 280, 750, 152,  87, 115], dtype=int64)